In [1]:
import pandas as pd
import numpy as np

In [2]:
sr = pd.Series([1,2,3,4], index=list('abcd'),name="SR1")

In [3]:
sr

a    1
b    2
c    3
d    4
Name: SR1, dtype: int64

In [4]:
sr.name

'SR1'

In [5]:
sr.dtype

dtype('int64')

In [6]:
sr.shape

(4,)

In [7]:
sr.ndim

1

In [8]:
sr.size

4

In [10]:
sr.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [11]:
df = pd.DataFrame([[1,2,3,4],[5,6,7,8]], index=['a','b'], columns=['c1','c2','c3','c4'])
df

   c1  c2  c3  c4
a   1   2   3   4
b   5   6   7   8

In [12]:
df.shape

(2, 4)

In [13]:
df.size

8

In [14]:
df.ndim

2

In [15]:
df.index

Index(['a', 'b'], dtype='object')

In [16]:
df.columns

Index(['c1', 'c2', 'c3', 'c4'], dtype='object')

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, a to b
Data columns (total 4 columns):
c1    2 non-null int64
c2    2 non-null int64
c3    2 non-null int64
c4    2 non-null int64
dtypes: int64(4)
memory usage: 80.0+ bytes

In [18]:
s = set([i for i in dir(pd.Series) if not i.startswith("_")])
d = set([i for i in dir(pd.DataFrame) if not i.startswith("_")])

count = 0
for i in (s-d):
    count += 1
    print(i, end=", ")
    if (count%4 == 0):
        print()

unique, is_monotonic, dt, value_counts,
flags, itemsize, nonzero, view,
ptp, dtype, hasnans, tolist,
cat, to_frame, real, asobject,
name, compress, divmod, item,
repeat, from_array, imag, valid,
data, str, is_monotonic_decreasing, is_monotonic_increasing,
argsort, strides, factorize, searchsorted,
map, argmax, argmin, autocorr,
base, nbytes, between, put,
ftype, ravel, is_unique,

In [ ]:
df_f = pd.read_csv('../data/series_dataframe.csv', usecols=['Member','Series','DataFrame'], encoding='euc-kr')

In [19]:
obj = pd.Series([1,2,3,4])
obj

0    1
1    2
2    3
3    4
dtype: int64

In [22]:
obj.values

array([1, 2, 3, 4])

In [23]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [24]:
obj.dtype

dtype('int64')

In [25]:
d = {'a':1, 'b':2, 'c':3}
ser = pd.Series(d, name='something')
ser

a    1
b    2
c    3
Name: something, dtype: int64

In [26]:
# 위와 같은 결과
index = ['a','b','c']
obj1 = pd.Series([1,2,3], index=index, name="TEST")
obj1

a    1
b    2
c    3
Name: TEST, dtype: int64

In [27]:
s = pd.Series(np.random.randn(5))
s

0   -1.538484
1    1.528296
2   -0.051728
3    0.499641
4   -0.575590
dtype: float64

In [28]:
obj = pd.Series([1,2,3,4], name="obj")
obj.shape, obj.ndim

((4,), 1)

In [30]:
id(obj.values)

140538485199296

In [33]:
obj.dtype, obj.nbytes

(dtype('int64'), 32)

In [34]:
obj_emp = pd.Series()
obj_emp.empty

True

In [35]:
s1 = pd.Series([1,2,3,4], name='s1')
s2 = pd.Series(['a','b','c','d'], name='s2')
df = pd.DataFrame({'s1':s1, 's2':s2})
df

   s1 s2
0   1  a
1   2  b
2   3  c
3   4  d

In [36]:
df['s1']

0    1
1    2
2    3
3    4
Name: s1, dtype: int64

In [37]:
s1 == df['s1']

0    True
1    True
2    True
3    True
Name: s1, dtype: bool

In [39]:
# 생성된 시리즈를 리스트에 넣고 생성자에 넣으면 -> 시리즈가 행으로 들어감 
# 딕셔너리처럼 키가 없어 리스트에 있는 시리즈를 보고 행의 레이블로 인식하여 행 단위로 저장
df_a = pd.DataFrame([s1,s2])
df_a

    0  1  2  3
s1  1  2  3  4
s2  a  b  c  d

In [40]:
data = {'AAA' : {'a':4,'b':5,'c':6,'d':7},'BBB' : {'a':10,'b':20,'c':30,'d':40},'CCC' : {'a':100,'b':50,'c':-30,'d':70}}
df = pd.DataFrame(data)
df

   AAA  BBB  CCC
a    4   10  100
b    5   20   50
c    6   30  -30
d    7   40   70

In [41]:
df2 = pd.DataFrame(data, columns=['AAA','CCC'])
df2

   AAA  CCC
a    4  100
b    5   50
c    6  -30
d    7   70

In [42]:
names = ['Bob','Jessica','Mary','John','Mel']
births = [968, 155, 77, 578, 973]
BabyDataSet = list(zip(names, births)) # 튜플 만들어진 거에 다시 리스트 생성자 사용
df = pd.DataFrame(BabyDataSet, columns=['Names','Births']) # 역시 행으로 들어감 
df

     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973

In [43]:
df.axes, df.index, df.columns

([RangeIndex(start=0, stop=5, step=1),
  Index(['Names', 'Births'], dtype='object')],
 RangeIndex(start=0, stop=5, step=1),
 Index(['Names', 'Births'], dtype='object'))

In [44]:
df.shape, df.ndim, df.size

((5, 2), 2, 10)

In [51]:
sat = pd.read_csv("/mnt/c/Workspace/handson_pandas/data/2014_korea_sat_scores.csv", encoding='euc-kr').dropna(axis=1)
sat.head()

   등급     과목 구분점수  도수(명)  비율(%)
0   1  국어 A형  128  13866   4.30
1   2  국어 A형  123  23599   7.32
2   3  국어 A형  116  42470  13.17
3   4  국어 A형  108  52640  16.32
4   5  국어 A형   97  63896  19.81

In [52]:
sat['도수(명)'].head()

0    13866
1    23599
2    42470
3    52640
4    63896
Name: 도수(명), dtype: int64

In [53]:
(sat['도수(명)'] < 20000).head()

0     True
1    False
2    False
3    False
4    False
Name: 도수(명), dtype: bool

In [54]:
sat[sat['도수(명)'] < 20000].head()

    등급     과목  구분점수  도수(명)  비율(%)
0    1  국어 A형   128  13866   4.30
8    9  국어 A형  60미만  12554   3.89
9    1  국어 B형   127  12615   4.45
16   8  국어 B형    59  19943   7.03
17   9  국어 B형  59미만  10868   3.83

In [55]:
l_sat = ((sat['도수(명)'] < 20000) & (sat['비율(%)'] <= 5.0))
l_sat.head()

0     True
1    False
2    False
3    False
4    False
dtype: bool

In [56]:
l_sat.sum()

71

In [57]:
sat_logic = sat[l_sat]
sat_logic.head()

    등급     과목  구분점수  도수(명)  비율(%)
0    1  국어 A형   128  13866   4.30
8    9  국어 A형  60미만  12554   3.89
9    1  국어 B형   127  12615   4.45
17   9  국어 B형  59미만  10868   3.83
18   1  수학 A형   137  19675   4.77

In [58]:
sat_ser = sat['도수(명)']
sat_ser[sat_ser < 20000].head()

0     13866
8     12554
9     12615
16    19943
17    10868
Name: 도수(명), dtype: int64

In [59]:
import seaborn as sns

In [60]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [61]:
titanic[['age','sex','alive']].isnull().sum()

age      177
sex        0
alive      0
dtype: int64

In [62]:
titanic[['age']].head()

    age
0  22.0
1  38.0
2  26.0
3  35.0
4  35.0

In [63]:
titanic['age'].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [64]:
titanic_age = titanic['age']
titanic_age[[0,3,4]]

0    22.0
3    35.0
4    35.0
Name: age, dtype: float64